Revit 2027 API
FabricationPart.GetOptionValue Method
 Gets the value of specified fabrication option definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetOptionValue(
	FabricationOptionDefinition option
)
Public Function GetOptionValue (
	option As FabricationOptionDefinition
) As Double
public:
double GetOptionValue(
	FabricationOptionDefinition^ option
)
member GetOptionValue :
        option : FabricationOptionDefinition -> float
Parameters
option FabricationOptionDefinition
 The fabrication option to get.
Return Value
Double
 The value to be returned, in the Revit internal units.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace